# Pandas

In [ ]:
import pandas as pd
data={"name":["jon","Peter","Lisa"],
      "Age":[25,28,31],
      "Salary":[300000,45000,25000]}
df=pd.DataFrame(data)
print(df)

    name  Age  Salary
0    jon   25  300000
1  Peter   28   45000
2   Lisa   31   25000

In [ ]:
df=pd.read_excel("expense3.xlsx")
print(df)

         Date    Category       Sub-Category   Amount Payment Mode
0  2023-01-01     Grocery             Grocery      30         Cash
1  2023-01-02        Food          Restaurant     890          UPI
2  2023-01-04         123              Zomato     257          NaN
3  2023-01-06  Essentials               Diary     120          UPI
4  2023-01-06  Essentials             Perfume    1500         Cash
5  2023-01-09     Grocery  Fruits and Veggies     456         Cash
6  2023-01-10       Bills          House Rent   16000          UPI
7  2023-01-10     Grocery      Tomato KetchUp      70          UPI
8  2023-01-12        Food                Chai      15          UPI
9  2023-01-15  Essentials      Salt and Sugar      50          NaN
10 2023-01-17     Grocery           Chocolate     100          UPI
11 2023-01-17        Food          Restaurant     780         Card
12 2023-01-18  Essentials            Food Oil     120          NaN
13 2023-01-18        Food              Zomato     230          UPI
14 2023-01-19     Grocery                Milk      26          UPI
15 2023-01-20  Essentials             Shampoo     780          UPI
16 2023-01-20  Essentials           Lunch Box     890         Cash
17 2023-01-21     Clothes               Dress    1000          NaN
18 2023-01-22     Clothes               Dress    1890          UPI
19 2023-01-23     Grocery      Bread and Milk      56         Cash
20 2023-01-24        Food  Fruits and Veggies     530         Cash
21 2023-01-26        Food                Chai      10          UPI
22 2023-01-26     Grocery               Maggi     140          UPI
23 2023-01-27        Food              Zomato     300          UPI
24 2023-01-27        Food                Chai      10          UPI
25 2023-01-28  Essentials           Bedsheets    1025         Cash
26 2023-01-29       Bills             Mobile     1650          UPI
27 2023-01-29     Grocery                Daal     150         Cash
28 2023-01-30       Bills            Cylinder    1074          UPI

In [ ]:
print(df.head())

        Date    Category Sub-Category   Amount Payment Mode
0 2023-01-01     Grocery       Grocery      30         Cash
1 2023-01-02        Food    Restaurant     890          UPI
2 2023-01-04         123        Zomato     257          NaN
3 2023-01-06  Essentials         Diary     120          UPI
4 2023-01-06  Essentials       Perfume    1500         Cash

In [ ]:
print(df.tail(10))

         Date    Category       Sub-Category   Amount Payment Mode
19 2023-01-23     Grocery      Bread and Milk      56         Cash
20 2023-01-24        Food  Fruits and Veggies     530         Cash
21 2023-01-26        Food                Chai      10          UPI
22 2023-01-26     Grocery               Maggi     140          UPI
23 2023-01-27        Food              Zomato     300          UPI
24 2023-01-27        Food                Chai      10          UPI
25 2023-01-28  Essentials           Bedsheets    1025         Cash
26 2023-01-29       Bills             Mobile     1650          UPI
27 2023-01-29     Grocery                Daal     150         Cash
28 2023-01-30       Bills            Cylinder    1074          UPI

In [ ]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29 entries, 0 to 28
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           29 non-null     datetime64[ns]
 1   Category       29 non-null     object
 2   Sub-Category   29 non-null     object
 3   Amount         29 non-null     int64
 4   Payment Mode   25 non-null     object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 1.3+ KB
None

In [ ]:
print(df.describe())

                                Date        Amount
count                             29     29.000000
mean   2023-01-17 19:02:04.137931008   1039.620690
min              2023-01-01 00:00:00     10.000000
25%              2023-01-10 00:00:00     70.000000
50%              2023-01-19 00:00:00    257.000000
75%              2023-01-26 00:00:00    890.000000
max              2023-01-30 00:00:00  16000.000000
std                              NaN   2927.684353

In [ ]:
print(df.isnull().sum())

Date             0
Category         0
Sub-Category     0
Amount           0
Payment Mode     4
dtype: int64

**handling Duplicate values and missinging values**

In [ ]:
# handling Duplicate values
data=pd.read_csv("company1.csv")
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [ ]:
print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   EEID    7 non-null      object
 1   Name    6 non-null      object
 2   gender  6 non-null      object
 3   salary  5 non-null      float64
dtypes: float64(1), object(3)
memory usage: 356.0+ bytes
None

In [ ]:
print(data.describe())

             salary
count      5.000000
mean   24400.000000
std     2607.680962
min    20000.000000
25%    25000.000000
50%    25000.000000
75%    25000.000000
max    27000.000000

In [ ]:
print(data.isnull().sum())

EEID      0
Name      1
gender    1
salary    2
dtype: int64

In [ ]:
print(data["EEID"].duplicated().sum())

2

In [ ]:
print(data.drop_duplicates("EEID"))

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN

In [ ]:
# missinging values in it
print(data.isnull().sum())

EEID      0
Name      1
gender    1
salary    2
dtype: int64

In [ ]:
print(data.dropna()) # can't drop

    EEID    Name gender   salary
1  EMP02   rohit      M  25000.0
3  EMP01  ayushi      F  20000.0

In [ ]:
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN

In [ ]:
import numpy as np
print(data.replace(np.nan,30000))

    EEID      Name gender   salary
0  EMP01    ayushi      F  30000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali  30000  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     30000      M  25000.0
5  EMP06     rohit      M  30000.0

In [ ]:

data["salary"]=data["salary"].replace(np.nan,30000)
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F  30000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  30000.0

In [ ]:
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [ ]:

data["salary"]=data["salary"].replace(np.nan,data["salary"].mean())
print(data)
print(data["salary"].mean())

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0
24400.0

In [ ]:
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

backward and forward fill

In [ ]:
print(data.fillna(method="bfill")) # back word fill

    EEID      Name gender   salary
0  EMP01    ayushi      F  25000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     rohit      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0

<ipython-input-42-be704d4cdb5a>:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method="bfill"))

In [ ]:
print(data.fillna(method="ffill")) # forword fill

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      M  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05    ayushi      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0

<ipython-input-43-a9fa63681fb4>:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method="ffill"))

**columns Transformation**

In [ ]:
import pandas as pd
df=pd.read_excel("ESD.xlsx")
print(df)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]

In [ ]:
df.loc[(df["Bonus %"]==0),"GetBonus"]="no bouns"
df.loc[(df['Bonus %']>0),"GetBonus"]="bonus"
print(df)

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date  GetBonus
0       0.15  United States    Seattle 2021-10-16     bonus
1       0.00          China  Chongqing        NaT  no bouns
2       0.20  United States    Chicago        NaT     bonus
3       0.07  United States    Chicago        NaT     bonus
4       0.00  United States    Phoenix        NaT  no bouns
..       ...            ...        ...        ...       ...
995     0.00  United States   Columbus        NaT  no bouns
996     0.00          China    Chengdu 2018-01-08  no bouns
997     0.15  United States      Miami        NaT     bonus
998     0.00          China    Chengdu        NaT  no bouns
999     0.31  United States      Miami        NaT     bonus

[1000 rows x 15 columns]

In [ ]:
import pandas as pd
df=pd.read_csv("company1.csv")
print(df)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [ ]:
df["salary"]=df["salary"].replace(np.nan,df["salary"].mean())
print(df)

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0

In [ ]:
df["Name"]=df["Name"].fillna  (method="ffill")
df["gender"]=df["gender"].fillna(method="ffill")
print(df)

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      M  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05    ayushi      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0

<ipython-input-69-5fd87dfa1c3c>:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Name"]=df["Name"].fillna  (method="ffill")
<ipython-input-69-5fd87dfa1c3c>:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["gender"]=df["gender"].fillna(method="ffill")

In [ ]:
df["Bonus"]=(df["salary"]/100)*20
print(df)

    EEID      Name gender   salary   Bonus
0  EMP01    ayushi      F  24400.0  4880.0
1  EMP02     rohit      M  25000.0  5000.0
2  EMP03  pranjali      M  27000.0  5400.0
3  EMP01    ayushi      F  20000.0  4000.0
4  EMP05    ayushi      M  25000.0  5000.0
5  EMP06     rohit      M  24400.0  4880.0
6  EMP02     rohit      M  25000.0  5000.0

In [ ]:
import pandas as pd
data={"Months":["January","February","March","April"]}
a=pd.DataFrame(data)
print(a)

     Months
0   January
1  February
2     March
3     April

In [ ]:
def extract(value):
  return value[:3]
a["Short_months"]=a["Months"].map(extract)
print(a)

     Months Short_months
0   January          Jan
1  February          Feb
2     March          Mar
3     April          Apr

**group by in pandas**

In [ ]:
import pandas as pd
data=pd.read_excel("ESD.xlsx")
print(data.head())

     EEID        Full Name                 Job Title Department  \
0  E02387      Emily Davis                Sr. Manger         IT
1  E04105    Theodore Dinh       Technical Architect         IT
2  E02572     Luna Sanders                  Director    Finance
3  E02832  Penelope Jordan  Computer Systems Manager         IT
4  E01639        Austin Vo               Sr. Analyst    Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409

   Bonus %        Country       City  Exit Date
0     0.15  United States    Seattle 2021-10-16
1     0.00          China  Chongqing        NaT
2     0.20  United States    Chicago        NaT
3     0.07  United States    Chicago        NaT
4     0.00  United States    Phoenix        NaT

In [ ]:
gp=data.groupby("Department").agg({"Gender":"count"})
print(gp)

                 Gender
Department
Accounting           96
Engineering         158
Finance             120
Human Resources     125
IT                  241
Marketing           120
Sales               140

In [ ]:
gp=data.groupby(["Department","Gender"]).agg({"EEID":"count"})
print(gp)

                        EEID
Department      Gender
Accounting      Female    53
                Male      43
Engineering     Female    80
                Male      78
Finance         Female    69
                Male      51
Human Resources Female    64
                Male      61
IT              Female   119
                Male     122
Marketing       Female    57
                Male      63
Sales           Female    76
                Male      64

In [ ]:
gp1=data.groupby(["Country","Gender"]).agg({"Age":"mean","Annual Salary":"max"})
print(gp1)

                            Age  Annual Salary
Country       Gender
Brazil        Female  42.240000         258426
              Male    45.312500         249506
China         Female  44.752294         249686
              Male    46.027523         257194
United States Female  44.580838         258498
              Male    43.783172         258081

**Merge join concatenate in pandas**

In [ ]:
import pandas as pd
data1={"Emp ID":["E01","E02","E03","E04","E05","E06"],
       "Employee":["jon","ken","ravi","herry","jerry","killva"],
       "Age":[22,23,24,26,28,21]}
data2={"Emp ID":["E01","E02","E03","E04","E05","E06"],
       "Salary":[20000,30000,32000,21000,33000,19000]}
data=pd.DataFrame(data1)

data1=pd.DataFrame(data2)
print(data)
print()
print(data1)

  Emp ID Employee  Age
0    E01      jon   22
1    E02      ken   23
2    E03     ravi   24
3    E04    herry   26
4    E05    jerry   28
5    E06   killva   21

  Emp ID  Salary
0    E01   20000
1    E02   30000
2    E03   32000
3    E04   21000
4    E05   33000
5    E06   19000

In [ ]:
print(pd.merge(data,data1,on="Emp ID"))

  Emp ID Employee  Age  Salary
0    E01      jon   22   20000
1    E02      ken   23   30000
2    E03     ravi   24   32000
3    E04    herry   26   21000
4    E05    jerry   28   33000
5    E06   killva   21   19000

In [ ]:
import pandas as pd
data1={"Emp ID":["E01","E02","E03","E04","E09","E06"],
       "Employee":["jon","ken","ravi","herry","jerry","killva"],
       "Age":[22,23,24,26,28,21]}
data2={"Emp ID":["E01","E07","E03","E04","E05","E06"],
       "Salary":[20000,30000,32000,21000,33000,19000]}
data=pd.DataFrame(data1)

data1=pd.DataFrame(data2)
print(data)
print()
print(data1)

  Emp ID Employee  Age
0    E01      jon   22
1    E02      ken   23
2    E03     ravi   24
3    E04    herry   26
4    E09    jerry   28
5    E06   killva   21

  Emp ID  Salary
0    E01   20000
1    E07   30000
2    E03   32000
3    E04   21000
4    E05   33000
5    E06   19000

In [ ]:
print(pd.merge(data,data1,on="Emp ID"))

  Emp ID Employee  Age  Salary
0    E01      jon   22   20000
1    E03     ravi   24   32000
2    E04    herry   26   21000
3    E06   killva   21   19000

In [ ]:
print(pd.merge(left=data,right=data1,on="Emp ID",how="left"))

  Emp ID Employee  Age   Salary
0    E01      jon   22  20000.0
1    E02      ken   23      NaN
2    E03     ravi   24  32000.0
3    E04    herry   26  21000.0
4    E09    jerry   28      NaN
5    E06   killva   21  19000.0

In [ ]:
print(pd.merge(left=data,right=data1,on="Emp ID",how="right"))

  Emp ID Employee   Age  Salary
0    E01      jon  22.0   20000
1    E07      NaN   NaN   30000
2    E03     ravi  24.0   32000
3    E04    herry  26.0   21000
4    E05      NaN   NaN   33000
5    E06   killva  21.0   19000

In [ ]:
data1={"Emp ID":["E01","E02","E03","E04","E09","E06"],
       "Employee":["jon","ken","ravi","herry","jerry","killva"],
       "Age":[22,23,24,26,28,21]}
data2={"Emp ID":["E07","E08","E09","E10","E11","E12"],
       "Employee":["jan","keen","radi","hero","jemel","jin wo sung"],
       "Age":[22,23,24,26,28,21]}
data1=pd.DataFrame(data1)
data2=pd.DataFrame(data2)
print(data1)
print()
print(data2)

  Emp ID Employee  Age
0    E01      jon   22
1    E02      ken   23
2    E03     ravi   24
3    E04    herry   26
4    E09    jerry   28
5    E06   killva   21

  Emp ID     Employee  Age
0    E07          jan   22
1    E08         keen   23
2    E09         radi   24
3    E10         hero   26
4    E11        jemel   28
5    E12  jin wo sung   21

In [ ]:
print(pd.concat([data1,data2]))

  Emp ID     Employee  Age
0    E01          jon   22
1    E02          ken   23
2    E03         ravi   24
3    E04        herry   26
4    E09        jerry   28
5    E06       killva   21
0    E07          jan   22
1    E08         keen   23
2    E09         radi   24
3    E10         hero   26
4    E11        jemel   28
5    E12  jin wo sung   21

**compare dataframe**

In [ ]:
import pandas as pd
dict={"Fruits":["mango","banana","papaya","apple"],
      "Price":[100,80,150,210],
      "Quatity":[15,10,10,3]}
df1=pd.DataFrame(dict)
print(df1)

df2=df1.copy()
df2.loc[0,"Price"]=120
df2.loc[1,"Quatity"]=12
df2.loc[2,"Fruits"]="kiwi"
df2.loc[2,"Price"]=120
df2.loc[3,"Quatity"]=12

print(df2)

   Fruits  Price  Quatity
0   mango    100       15
1  banana     80       10
2  papaya    150       10
3   apple    210        3
   Fruits  Price  Quatity
0   mango    120       15
1  banana     80       12
2    kiwi    120       10
3   apple    210       12

In [ ]:

print(df.compare(df2))
print()
print(df1.compare(df2,keep_equal=True))
print()
print(df1.compare(df2,keep_shape=True))
print()
print(df1.compare(df2,keep_shape=True,keep_equal=True))

   Fruits        Price        Quatity
     self other   self  other    self other
0     NaN   NaN  100.0  120.0     NaN   NaN
1     NaN   NaN    NaN    NaN    10.0  12.0
2  papaya  kiwi  150.0  120.0     NaN   NaN
3     NaN   NaN    NaN    NaN     3.0  12.0

   Fruits         Price       Quatity
     self   other  self other    self other
0   mango   mango   100   120      15    15
1  banana  banana    80    80      10    12
2  papaya    kiwi   150   120      10    10
3   apple   apple   210   210       3    12

   Fruits        Price        Quatity
     self other   self  other    self other
0     NaN   NaN  100.0  120.0     NaN   NaN
1     NaN   NaN    NaN    NaN    10.0  12.0
2  papaya  kiwi  150.0  120.0     NaN   NaN
3     NaN   NaN    NaN    NaN     3.0  12.0

   Fruits         Price       Quatity
     self   other  self other    self other
0   mango   mango   100   120      15    15
1  banana  banana    80    80      10    12
2  papaya    kiwi   150   120      10    10
3   apple   apple   210   210       3    12

**pivoting and melting**

In [ ]:
# pivoting
import pandas as pd
dict={"keys":["k1","k2","k1","k2"],
      "Name":["jon","peter","ben","gojo"],
      "Houses":["red","blue","green","red"],
      "Grades":["3rd",'4th',"5th","3rd"]}
df=pd.DataFrame(dict)
print(df)

  keys   Name Houses Grades
0   k1    jon    red    3rd
1   k2  peter   blue    4th
2   k1    ben  green    5th
3   k2   gojo    red    3rd

In [ ]:
print(df.pivot(index="keys",columns="Name",values=["Houses","Grades"]))

     Houses                 Grades
Name    ben gojo  jon peter    ben gojo  jon peter
keys
k1    green  NaN  red   NaN    5th  NaN  3rd   NaN
k2      NaN  red  NaN  blue    NaN  3rd  NaN   4th

In [ ]:
# melting
dict={
      "Name":["jon","peter","ben","gojo"],
      "Houses":["red","blue","green","red"],
      "Grades":["3rd",'4th',"5th","3rd"]}
df=pd.DataFrame(dict)
print(df)

    Name Houses Grades
0    jon    red    3rd
1  peter   blue    4th
2    ben  green    5th
3   gojo    red    3rd

In [ ]:
print(pd.melt(df,id_vars=["Name"],value_vars=["Houses","Grades"]))

    Name variable  value
0    jon   Houses    red
1  peter   Houses   blue
2    ben   Houses  green
3   gojo   Houses    red
4    jon   Grades    3rd
5  peter   Grades    4th
6    ben   Grades    5th
7   gojo   Grades    3rd

In [ ]:
print(pd.melt(df,id_vars=["Name"],value_vars=["Houses","Grades"],value_name="values_of Houses",var_name="names"))

    Name   names values_of Houses
0    jon  Houses              red
1  peter  Houses             blue
2    ben  Houses            green
3   gojo  Houses              red
4    jon  Grades              3rd
5  peter  Grades              4th
6    ben  Grades              5th
7   gojo  Grades              3rd